Revit 2015 API
CustomExporter.Export Method (IList<ElementId>)
 Exports a collection of 3-D views
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public void Export(
	IList<ElementId> viewIds
)
Visual Basic
Public Sub Export ( _
	viewIds As IList(Of ElementId) _
)
Visual C++
public:
void Export(
	IList<ElementId^>^ viewIds
)
Parameters
viewIds
Type: System.Collections.Generic.IList<ElementId>
 An array of 3-D views to export
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  One or more elements in viewIds is not a valid 3D view. For example, templates are not considered valid views to export.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  The instance of IExportContext is not valid. -or- Rendering is currently not supported in the running instance of Revit. One reason for that to happen is that rendering and material libraries are not currently available.
See Also
CustomExporter Class
Export Overload
Autodesk.Revit.DB Namespace